In [ ]:
pip install plotly

In [1]:
# Dependencies and Setup
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import plotly.express as px
import datetime
import calendar
from scipy.stats import linregress
import seaborn as sns

# File to Load
file_to_load = "output_data/cleaned_avo.csv"

# Read Avocado File and store into Pandas data frame
avocado_data = pd.read_csv(file_to_load)

# Preview of the DataFrame
avocado_data.head()

,Unnamed: 0,Date,Average Price,Total Volume,Hass Small,Hass Large,Hass XLarge,Total Bags,Small Bags,Large Bags,XLarge Bags,Type,Year,Region,Total Sales
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany,85434.70
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany,74083.92
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany,109944.80
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany,85311.52
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany,65330.69

In [2]:
delete_row = avocado_data[avocado_data["Region"]=='TotalUS'].index
avocado_data = avocado_data.drop(delete_row)
avocado_data=avocado_data.drop(columns='Unnamed: 0',axis=1)
avocado_data['Total Sales']=''
Total=avocado_data['Average Price']*avocado_data['Total Volume']
avocado_data['Total Sales']=Total
avocado_data['Total Sales']= avocado_data['Total Sales'].map("${:.2f}".format)
avocado_data

,Date,Average Price,Total Volume,Hass Small,Hass Large,Hass XLarge,Total Bags,Small Bags,Large Bags,XLarge Bags,Type,Year,Region,Total Sales
0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany,$85434.70
1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany,$74083.92
2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany,$109944.80
3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany,$85311.52
4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany,$65330.69
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17906,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico,$27831.97
17907,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico,$23748.55
17908,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico,$25743.84
17909,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico,$31276.07
17910,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico,$28333.12

In [3]:
#convert object back to float
avocado_data['Total Sales']=avocado_data['Total Sales'].str.replace('$',' ',regex=True).astype(float)

data15=avocado_data[avocado_data['Year']==2015].groupby('Region')
data16=avocado_data[avocado_data['Year']==2016].groupby('Region')
data17=avocado_data[avocado_data['Year']==2017].groupby('Region')
data18=avocado_data[avocado_data['Year']==2018].groupby('Region')

In [4]:
#totalvol(million)
T5=data15['Total Volume'].sum()/1000000
T6=data16['Total Volume'].sum()/1000000
T7=data17['Total Volume'].sum()/1000000
T8=data18['Total Volume'].sum()/1000000
totalvol_sum=pd.DataFrame({"2015": T5,
                            "2016":T6,
                              "2017":T7,
                              "2018":T8
                              })

In [5]:
Without_8=totalvol_sum.drop(['California','GreatLakes','Midsouth','Northeast','Plains','SouthCentral','Southeast','West'])
Without_8['Total']=''
sum_column = Without_8["2015"] + Without_8["2016"]+Without_8["2017"]+Without_8["2018"]
Without_8['Total']=sum_column
Without_8.head()

                          2015       2016       2017       2018       Total
Region
Albany                4.029896   5.264336   5.231582   1.541986   16.067800
Atlanta              23.231698  28.326878  28.815120   8.231422   88.605119
BaltimoreWashington  40.645580  40.893802  41.015634  12.158903  134.713919
Boise                 3.784357   4.653510   4.760561   1.214760   14.413188
Boston               27.454992  30.571315  30.610672   8.637006   97.273985

In [6]:
top8=totalvol_sum.loc[['California','GreatLakes','Midsouth','Northeast','Plains','SouthCentral','Southeast','West']]

In [7]:
# File to Load
file = "./Resources/p.csv"
# Read Population csv and store into Pandas data frame
popdata = pd.read_csv(file, encoding="ISO-8859-1")
df_pop=popdata.drop([
    'GEO.id', 'GEO.id2','GEO.display-label','GCT_STUB.target-geo-id','GCT_STUB.target-geo-id2','GCT_STUB.display-label'
], axis=1)
df_pop=df_pop.drop(0)
df_pop=df_pop.rename(columns={"GCT_STUB.display-label.1":"City","HD01":"P",})
pop=df_pop['P']
sep=pop.str.split("(",expand=True)
population=sep[0]
df_pop["Population"]=population
df_pop=df_pop.drop(columns="P")
df_pop.head()

              City Population
1    United States  308745538
2          Alabama    4779736
3      Auburn city      53380
4  Birmingham city     212237
5     Decatur city      55683

In [8]:
df_pop['Population']=df_pop['Population'].astype(float)
Northeast=['West Virginia','Maryland','Delaware','New Jersey','Connecticut','Rhode Island','Massachusetts','Vermont','New Hampshire','New York','Pennsylvania','Maine']
Northeast=df_pop.loc[df_pop['City'].apply(lambda x: x in Northeast)]
Midsouth=['Kentucky','Virginia','Tennessee','Maryland','North Carolina','South Carolina']
Midsouth=df_pop.loc[df_pop['City'].apply(lambda y: y in Midsouth)]
Southeast=['Mississippi','Alabama','Georgia','Florida']
Southeast=df_pop.loc[df_pop['City'].apply(lambda a: a in Southeast)]
Plains=['North Dakota','South Dakota','Minnesota','Nebraska','Iowa','Kansas','Missouri']
Plains=df_pop.loc[df_pop['City'].apply(lambda b: b in Plains)]
SouthCentral=['Oklahoma','Arkansas','Texas','Louisiana']
SouthCentral=df_pop.loc[df_pop['City'].apply(lambda b: b in SouthCentral)]
Greatlakes=['Wisconsin','Illinois','Indiana','Michigan','Ohio']
Greatlakes=df_pop.loc[df_pop['City'].apply(lambda b: b in Greatlakes)]
West=['Washington','Oregon','Idaho','Montana','Wyoming','Nevada','Utah','Colorado','Arizona','New Mexico']
West=df_pop.loc[df_pop['City'].apply(lambda b: b in West)]
Ca=df_pop.loc[df_pop['City']=='California']

In [9]:
n=Northeast["Population"].sum()
m=Midsouth["Population"].sum()
s=Southeast["Population"].sum()
sc=SouthCentral["Population"].sum()
p=Plains["Population"].sum()
g=Greatlakes["Population"].sum()
w=West["Population"].sum()
c=Ca["Population"].sum()

In [10]:
top8['Population']=(c,g,m,n,p,sc,s,w)
top8['2015 per capita']=(top8['2015']/top8['Population'])*1000000
top8['2016 per capita']=(top8['2016']/top8['Population'])*1000000
top8['2017 per capita']=(top8['2017']/top8['Population'])*1000000
top8['2018 per capita']=(top8['2018']/top8['Population'])*1000000

In [11]:
top8=top8.drop(columns=['2015','2016','2017','2018','Population'])

In [13]:
g

46421564.0

In [ ]:

fig, ax = plt.subplots() 
top8.plot(kind='bar',figsize=(13,10),rot=45,fontsize=15,ax=ax).legend(loc='upper center')

In [ ]:
x_axis = np.arange(len(Without_8))
plt.figure(figsize=(15,10))
tick_locations = [value for value in x_axis]
plt.bar(x_axis,Without_8['Total'], color="#ff4d94")
plt.title('Total Volume by Region over 4 years')
plt.xlabel('Region')
plt.ylabel('Total Volume (Million)')
plt.xticks(tick_locations, Without_8.index,rotation='vertical')
plt.show()

In [ ]:
top8=totalvol_sum.loc[['California','GreatLakes','Midsouth','Northeast','Plains','SouthCentral','Southeast','West']]
fig, ax = plt.subplots() 
top8.plot(kind='bar',figsize=(20,10),rot=0,fontsize=15,ax=ax).legend(loc='upper center')
ax.set(title="Top 8 Regions with Total Volume over 4 years",ylabel='Total Volume (Million)')